# GetBoxCenter Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Viewport..::..GetBoxCenter Method
Viewport Class See Also
---
Returns the center of the outline of the viewport on the sheet, excluding the viewport label.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ GetBoxCenter()
```

Visual Basic
---
```text
Public Function GetBoxCenter As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetBoxCenter()
```

# ### Return Value
The center of the outline of the viewport on the sheet.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The viewport is not on a sheet. |

# See Also
Viewport Class
Autodesk.Revit.DB Namespace